Table of Contents
 Class GrpcServer
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Server implementation for the Grpc connection.
public class GrpcServer : IGrpcServer, IGrpcCommunicator
Inheritance
object
GrpcServer
Implements
IGrpcServer
IGrpcCommunicator
Derived
GrpcReflectionServer
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcServer(IPluginLogger)
public GrpcServer(IPluginLogger logger)
Parameters
logger IPluginLogger
 GrpcServer(IPluginLogger, IGrpcService, IBlobStorageProvider, int, int)
Initializes the IdeaStatiCa Grpc server.
public GrpcServer(IPluginLogger logger, IGrpcService grpcService, IBlobStorageProvider blobStorageProvider, int maxDataLength = 104857600, int chunkSize = 65536)
Parameters
logger IPluginLogger
Logger
grpcService IGrpcService
blobStorageProvider IBlobStorageProvider
Provider of blob storages
maxDataLength int
The maximal size of GrpcMessage.data in bytes in grpc message
chunkSize int
Size of one chunk in bytes for blob storage data transferring
Fields
 Logger
public readonly IPluginLogger Logger
Field Value
IPluginLogger
Properties
 ClientID
Returns ID of currently connected client.
public string ClientID { get; }
Property Value
string
 GrpcService
grpc service for bi-directional streaming messaging
public IGrpcService GrpcService { get; }
Property Value
IGrpcService
 Host
The host
public string Host { get; }
Property Value
string
 Port
Port on which the server will communicate.
public int Port { get; }
Property Value
int
Methods
 StartAsync(string, int)
Starts the server.
public Task StartAsync(string clientId, int port)
Parameters
clientId string
Current client ID (PID)
port int
Port on which the server is running.
Returns
Task
 StopAsync()
Requests server to shutdown
public Task StopAsync()
Returns
Task
 Edit this page